Conrad-Rowling/Li-CellTesting_Script/Internal_Main/Internal_Main.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.3
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2019 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_1.h"
#include "ADC_1_FILTER.h"
#include "GND_ref.h"
#include "GND_ref_aliases.h"
#include "VRef.h"
#include "VRef_aliases.h"
#include "PGA_1.h"
#include "PGA_1_PVT.h"
#include "VTest.h"
#include "VTest_aliases.h"
#include "VrGnd.h"
#include "VrGnd_aliases.h"
#include "UART_1.h"
#include "UART_1_SPI_UART.h"
#include "UART_1_PINS.h"
#include "UART_1_SPI_UART_PVT.h"
#include "UART_1_PVT.h"
#include "UART_1_BOOT.h"
#include "I2C_1.h"
#include "I2C_1_I2C.h"
#include "I2C_1_PINS.h"
#include "I2C_1_I2C_PVT.h"
#include "I2C_1_PVT.h"
#include "I2C_1_BOOT.h"
#include "BLUE_LED.h"
#include "BLUE_LED_aliases.h"
#include "RELAY_EN.h"
#include "RELAY_EN_aliases.h"
#include "Timer_1.h"
#include "Clock_1.h"
#include "UART_IN.h"
#include "UART_IN_aliases.h"
#include "UART_OUT.h"
#include "UART_OUT_aliases.h"
#include "AMux_1.h"
#include "v_out.h"
#include "v_out_aliases.h"
#include "PVref_1.h"
#include "Opamp_1.h"
#include "AMux_2.h"
#include "Opamp_2.h"
#include "VBatUp.h"
#include "VBatUp_aliases.h"
#include "Opamp_3.h"
#include "VBatLow.h"
#include "VBatLow_aliases.h"
#include "TCPWM_1.h"
#include "Clock_2.h"
#include "isr_1.h"
#include "ADC_1_intSarClock.h"
#include "ADC_1_IRQ.h"
#include "ADC_1_intUabClock.h"
#include "UART_1_SCBCLK.h"
#include "I2C_1_SCBCLK.h"
#include "I2C_1_sda.h"
#include "I2C_1_sda_aliases.h"
#include "I2C_1_scl.h"
#include "I2C_1_scl_aliases.h"
#include "I2C_1_SCB_IRQ.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "core_cm0plus_psoc4.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

